//##################################################################################################################################################################//
//
// 背景ヘッダファイル [player.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//


#ifndef _BACKSCREEN_H_

#define _BACKSCREEN_H_

#include "main.h"

//プロトタイプ宣言
HRESULT InitTutorial(MODE mode);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif