//=============================================================================
//
// ベースシーン処理 [base.h]
// Author : itsuki takaiwa
//
//=============================================================================
#ifndef _BASE_H_
#define _BASE_H_

#include "scene.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//-----------------------------------------------------------------------------
// ベースクラス(派生クラス)
//-----------------------------------------------------------------------------
class CBase
{
public:
	CBase();
	~CBase();

	virtual HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR2 size) = 0;
	virtual void Uninit(void) = 0;
	virtual void Update(void) = 0;
	virtual void Draw(void) = 0;

private:
	CBase *m_pBase;			// ベースのポインタ
};
#endif