//=============================================================================
//
// ラクガキ管理処理 [graffiti_manager.cpp]
// Author : 
//
//=============================================================================
#include "graffiti_manager.h"

#include "manager.h"
#include "base.h"
#include "game.h"

//=============================================================================
// CGraffitiManagerのコンストラクタ
//=============================================================================
CGraffitiManager::CGraffitiManager()
{
	// メンバ変数の初期化
	m_nNumCurGraffiti = 0;
	m_nNumGraffiti = 0;
}

//=============================================================================
// CGraffitiManagerのデストラクタ
//=============================================================================
CGraffitiManager::~CGraffitiManager()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CGraffitiManager::Init(D3DXVECTOR3 pos, D3DXVECTOR2 size)
{
	// メンバ変数の初期化
	m_nNumCurGraffiti = 0;
	m_nNumGraffiti = 0;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CGraffitiManager::Uninit(void)
{
	// 削除
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CGraffitiManager::Update(void)
{
	// 現在のラクガキ数が0以下になったとき終了する
	if (m_nNumCurGraffiti <= 0)
	{
		// ゲーム情報の取得
		CBase *pBase = CManager::GetBase();

		if (pBase != NULL)
		{
			CGame *pGame = (CGame*)pBase;

			// ゲームモードを終了にする
			pGame->SetGameMode(CGame::GAMEMODE_FINISH);
		}
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CGraffitiManager::Draw(void)
{

}